app/controllers/postings_controller.rb

    def index
        @postings = Posting.all
---
SELECT "postings".* FROM "postings" WHERE (lower(type_of) IN ('user','professional') AND lower(subject) IN ('recruitment','cs','math','physics','chemistry','biology','english','languages','other'))

    def show
      id = params[:id] # retrieve user ID from URI route
      @posting = Posting.find(id) # look up posting by unique ID
---
SELECT "postings".* FROM "postings" WHERE "postings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @posting = Posting.new(posting_params)
        if @posting.save
---
INSERT INTO "postings" ("user_id", "type_of", "name", "price", "subject", "description", "availability", "contact") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["type_of", "User"], ["name", nil], ["price", 0.0], ["subject", "CS"], ["description", "A Nobody"], ["availability", "Always"], ["contact", "000000000"]]