app/controllers/postings_controller.rb

INSERT INTO "postings" ("user_id", "type_of", "name", "price", "subject", "description", "availability", "contact") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["type_of", "User"], ["name", "test2"], ["price", 5.0], ["subject", "CS"], ["description", "my code broke"], ["availability", "monday"], ["contact", "0000"]]
---
    def create
      @posting = Posting.new(posting_params)
      @posting.user = current_user # Associate the posting with the currently logged-in user

      if @posting.save