app/controllers/postings_controller.rb

    def show
      id = params[:id] # retrieve user ID from URI route
      @posting = Posting.find(id) # look up posting by unique ID
---
SELECT "postings".* FROM "postings" WHERE "postings"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

    def edit
      @posting = Posting.find(params[:id])
---
SELECT "postings".* FROM "postings" WHERE "postings"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def destroy
      @posting = Posting.find(params[:id])
      @posting.destroy
---
SELECT "postings".* FROM "postings" WHERE "postings"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
DELETE FROM "postings" WHERE "postings"."id" = ?  [["id", 13]]

    def update
      @posting = Posting.find(params[:id])
      @posting.update!(posting_params)
---
SELECT "postings".* FROM "postings" WHERE "postings"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "postings" SET "name" = ? WHERE "postings"."id" = ?  [["name", "Rutvik Rau"], ["id", 9]]

    def create
      @posting = Posting.new(posting_params)
      @posting.user = current_user # Associate the posting with the currently logged-in user

      if @posting.save
---
INSERT INTO "postings" ("user_id", "type_of", "name", "price", "subject", "description", "availability", "contact") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["type_of", "User"], ["name", "TestMan"], ["price", 0.0], ["subject", "Recruitment"], ["description", "A Nobody"], ["availability", "Always"], ["contact", "000000000"]]